# Brewfile for macOS dotfile modernization
# Uses GNU Stow for simple symlink-based dotfile management

# Core development tools
brew "git"
brew "curl"
brew "jq"
brew "tree"
brew "htop"
brew "stow"  # Symlink-based dotfile manager

# Modern shell tools
brew "fzf"
brew "bat"  # Better cat
brew "eza"  # Better ls (maintained fork of exa)
brew "ripgrep"  # Better grep
brew "fd"  # Better find
brew "zoxide"  # Better cd

# Development environment managers
brew "mise"  # Modern development environment manager (replaces multiple version managers)
brew "uv"    # Fast Python package manager

# VS Code
cask "visual-studio-code"

# Essential development tools
brew "vim"
brew "make"
brew "docker"
brew "docker-compose"

# Modern CLI alternatives
brew "dust"  # Better du
brew "bottom"  # Better top/htop
brew "hyperfine"  # Benchmarking tool
brew "tokei"  # Code statistics
brew "tealdeer"  # Faster tldr (man pages)

# Shell enhancement (oh-my-zsh only)
brew "starship"  # Modern shell prompt

# History management (choose one)
brew "atuin"  # Better shell history with sync

# macOS Specific Tools
cask "raycast"  # Better Spotlight replacement

# Fonts (install manually or via other means since homebrew/cask-fonts is deprecated)
# For nerd fonts, use: https://www.nerdfonts.com/font-downloads
# Or install via GUI: brew install --cask font-fira-code-nerd-font font-jetbrains-mono-nerd-font

# Developer Productivity
brew "glow"  # Markdown viewer in terminal
brew "fx"  # JSON viewer
